{
	"home": "HOME",
	"about": "About",
	"skills": "Skills",
	"projects": "Projects",
	"contact": "Contact",
	"headerTitle": "You can count on me in building Web and mobile App's Front-End",
	"mainTitle": "A Front-End Web Developer",
	"mainTitle2": "Hi, I'm",
	"myName": "Mehdi",
	"subMainTitle": "I have started my career path at about a year a ago via learning and developing application's front-end utilising React technology.Indeed, i have experience developing both mobile and web application in front-end section.Moreover, i have worked in a company as a front-end developer for three months",
	"aboutMe": "about me",
	"whoIam": "Who I Am",
	"starTitle": "Curious About Solving Technical Problems",
	"subStarTitle": "since my college period in bachelor's degree i was partially involved with some programming languages including: c++, java and python. Literally, i was just engaging with switching between various programming languages to figure out which one fits to me.In this duraition i mentioned i made some simple applications like calculator in Java and a guess number game in python.After this i have found that i'm more enthusiastic about making beautiful application's apperance.Since the issue i told i turned my path into learning HTML, CSS, Javascript and then React to achive my goal.All in all, the learning process i mentioned is still going on ...",
	"tech": "Technologies I can work with",
	"WhatBuilt": "What I've Built",
	"getInTouch": "Get In Touch",
	"fullName": "Full Name",
	"phoneNumber": "Phone Number",
	"email": "Email",
	"subject": "Subject",
	"message": "Message",
	"sendMessage": "Send Message",
	"front": "Front End Developer",
	"letsTalk": "I am available for remote or in person positions. Contact me and let's talk",
	"moreInfo": "More Info",
	"back": "BACK",
	"project": "Project",
	"overView": "OverView",
	"appFlow": "APP FLOW",
	"gitHub": "GitHub",
	"appFlowVideo": "Application Flow Video",
	"deliveroo": "This application is a clone version of Deliveroo which is a British online food delivery company.Actually, it's a semi fullstack project since enjoys a Content Management System (CMS) called sanity as it's back-end. I learned and coded the project along it's instructor from a tutorial on a Youtube channel.In this application you can order some food from multiple food delivery and manage your orders in your cart and then place your order (dummy payment).At the end you can check restaurant's location you ordered from on Map (google map). I also provied it's source code on GitHub and its app flow video.You can check them out down below.",
	"samex": "This app was built using React Native and TypeScript in order to serve currency exchange services.This app enjoys some API's and packages including NavigationContainer, Bottom Tabs Navigator, react-native-camera, CameraRoll, PersianDatePicker and so on ... Note: The project is still in development pahse and didn't launch.Since the issue i mentioned it's Github Repo is private. I also provided application flow video, you can check it out down below.",
	"hulu": "This application is a clone version of Hulu which is an American subscription streaming service.Actually, it's a semi fullstack project since enjoys The Movie Database API (TMDB) as it's database. I learned and coded the project along it's instructor from a tutorial on a Youtube channel.In this application you can have movies with different categories along with using lazy loading technology in next.js. It's user interface made with css grid and flex using taliwind css. I also provied it's source code on GitHub and its app flow video.You can check them out down below."
}
