{
	"home": "خانه",
	"about": "درباره",
	"skills": "مهارت ها",
	"projects": "پروژه ها",
	"contact": "تماس",
	"headerTitle": "برای ساخت وب سایت و اپلیکیشن موبایل در بخش فرانت اند میتونی رو من حساب کنی",
	"mainTitle": "یک توسعه دهنده فرانت اند",
	"mainTitle2": "سلام اسم من",
	"myName": "مهدی ،",
	"subMainTitle": "من برنامه و  مسیر کاری خودم رو حدود یک سال هست که بواسطه یادگیری و توسعه اپلیکیشن های مبتنی بر تکنولوژی ریکت شروع کردم به دلیل علاقه به حوزه فرانت اند دوست داشتم که در زمینه توسعه وب سایت و اپلیکیشن موبایل تجربه کسب کنم.همچنین تجربه کار در یک محیط عملیاتی رو به مدت سه ماه در یک  شرکت تونستم تجربه کنم",
	"aboutMe": "درباره من",
	"whoIam": "من کی ام ؟",
	"starTitle": "کنجکاو در رابطه با حل مسائل و مشکلات فنی",
	"subStarTitle": "از زمان تحصیل در مقطع کارشناسی تا حدودی درگیر زبان های برنامه نویسی مختلف بودم.زبان هایی مثل جاوا ، سی پلاس پلاس و پایتون و در واقع مشغول ازین شاخه به اون شاخه پریدن بین زبان های مختلف بودم تا مناسب ترین زبان رو برای خودم پیدا کنم. در این دوره زمانی تونستم چند برنامه ساده مثل ماشین حساب با استفاده از زبان جاوا و بازی حدس اعداد با استفاده از زبان پایتون رو بسازم.بعد از مدتی متوجه شدم که علاقه من بیشتر به سمت پیاده سازی ظاهر اپلیکیشن ها و وب سایت هاست و به همین دلیل مسیر یادگیری خودم رو به سمت اچ تی ام ال ، سی اس اس ، جاوا اسکریپت و در نهایت ریکت تغییر دادم تا به هدف و علاقه ای که داشتم نزدیک تر باشم و رو یه هم رفته مسیر یادگیری من در این حوزه کماکان ادامه داره ...",
	"tech": "تکنولوژی هایی که آشنایی دارم :",
	"WhatBuilt": "نمونه کار هایی که انجام دادم :",
	"getInTouch": "با من در ارتباط باش",
	"fullName": "نام و نام خانوادگی",
	"phoneNumber": "شماره تلفن",
	"email": "ایمیل",
	"subject": "موضوع",
	"message": "پیام",
	"sendMessage": "ارسال پیام",
	"front": "توسعه دهنده فرانت اند",
	"letsTalk": "بصورت حضوری و یا دورکاری میتونم با شما همکاری داشته باشم",
	"moreInfo": "اطلاعات بیشتر",
	"back": "بازگشت",
	"project": "پروژه",
	"overView": "نگاه کلی به پروژه :",
	"appFlow": "عملکرد اپلیکیشن",
	"gitHub": "گیت هاب",
	"appFlowVideo": "ویدیو عملکرد اپلیکیشن",
	"deliveroo": "این برنامه یک نسخه شبیه سازی شده از Deliveroo است که یک شرکت بریتانیایی ارسال غذای آنلاین است. در واقع این پروژه مشابه یک پرژه فول استک است زیرا از یک سیستم مدیریت محتوا (CMS) به نام sanity به عنوان back-end برخوردار است. من پروژه را از یک مدرس در یک کانال یوتیوب یاد گرفتم و همراه با مدرس اون رو کد نویسی کردم. در این برنامه می توانید چند نمونه غذا را از رستوران های موجود سفارش دهید و سفارشات خود را در سبد خرید خود مدیریت کنید و سپس سفارش خود را ثبت کنید (پرداخت ساختگی). در پایان شما می توانید مکان رستورانی را که از آن سفارش داده اید در نقشه (گوگل مپ) مشاهده کنید. من همچنین کد منبع آن را در GitHub و ویدیوی عملکرد  برنامه را تهیه کردم که می توانید آنها را در قسمت پایین بررسی کنید.",
	"samex": "این برنامه با استفاده از React Native و TypeScript به منظور ارائه خدمات صرافی آنلاین ساخته شده است. این برنامه از برخی API ها و پکیج ها از جمله NavigationContainer، Bottom Tabs Navigator، react-native-camera، CameraRoll، PersianDatePicker و غیره بهره می برد... توجه : پروژه هنوز در مرحله توسعه است و راه اندازی نشده است و به همین دلیل سورس کد قابل نمایش نیست. من همچنین فیلم عملکرد برنامه را تهیه کردم، می توانید آن را در قسمت پایین بررسی کنید.",
	"hulu": "این برنامه یک نسخه شبیه سازی شده از Hulu است که یک سرویس اشتراک ویدیواست. در واقع، این یک پروژه مشابه به با یک پروژه فول استک زیرا از API پایگاه داده فیلم    (TMDB)  به عنوان پایگاه داده برخوردار است. من پروژه را از یک مدرس در یک کانال یوتیوبی یاد گرفتم و کدنویسی کردم. در این برنامه شما می توانید فیلم هایی با دسته بندی های مختلف همراه با استفاده از فناوری بارگذاری تنبل (lazy loading) با استفاده از  next.js دسترسی داشته باشید. رابط کاربری با سی اس اس گرید فلکس و با استفاده از    taliwind css  ساخته شده است. من همچنین کد منبع آن را در GitHub و ویدیوی جریان برنامه آن ارائه کردم. می توانید آنها را در زیر بررسی کنید.",
	"restaurant": "این پروژه کوچک متعلق به مراحل اولیه فرآیند یادگیری توسعه فرانت اند من است. در واقع، من این پروژه را از یک دوره Udemy  به واسطه یک مدرس هندی کدنویسی کردم و یاد گرفتم. در واقع، من پروژه را گام به گام در کنار مدرس کدنویسی کردم. این پروژه فقط یک UI از یک restaurant   هست. علاوه بر این، برای هر دستگاهی کاملاً رسپانسیو است. من همچنین کد منبع آن را در گیت هاب خودم ارائه کردم که می توانید آن را در قسمت پایین بررسی کنید. علاوه بر این، می توانید ویدیو عملکرد برنامه را با استفاده از دکمه زیر مشاهده کنید.",
	"weatherApp": "من این پروژه را با استفاده از دوره Udemy کدنویسی کردم و یاد گرفتم. در این برنامه می توانید هر شهری را جستجو کنید و وضعیت آب و هوای آن را به دست آورید. این برنامه با اسفاده از React.js ساخته شده، همچنین از Openweather API برای واکشی داده های آب و هوا استفاده می برد. نکته جالب مربوط به این برنامه این است که به محض جستجو شهرمورد نظر، نمادی که وضعیت آب و هوا را نشان می دهد، بر اساس وضعیت آب و هوایی آن شهر تغییر می کند.شما می توانید کد منبع پروژه و ویدیو عملکرد برنامه را در قسمت پایین بررسی کنید."
}
